function pow(x, y) {
    let num = 1; // з множення на 1 буде починатись 0-вий цикл множення num на x, для переходу на цикл вперед/назад
    let square = y;
    for (let a = 0; a < square; a++) { // починаєм з 0-го циклу при умові, що а більше ніж у, і якщо поки умова повертає true, йдемо на крок вперед після виконання виразу 
      num = num * x; // вираз за яким рахуєм значення множення, допоки умова а < square повертає true 
    }

    for (let a = 0; a > square; a--) { // починаєм з 0-го циклу при умові, що а меньше ніж у, і якщо поки умова повертає true, йдемо на крок назад після виконання виразу
        num = num * x; // вираз за яким рахуєм значення множення, допоки умова а > square повертає true
      }
    if(square>0)
    return num; // умова яка вказує, що якщо square більше 0, то повертаєм значення нам після проходження вказаної кількості ітерацій 
    else // якщо ні, то...
    if (square === 0)
    return num = 1; // умова яка вказує, що якщо square строго дорівнює 0, то повертаєм значення 1 
    else // якщо ні, то...
    return 1/num; // умова яка вказує, що якщо значення square від'ємне, то повертаєм num розділене на 1, бо відємний степінь числа пожна зобразити як додатній степінь оберненого (дробового) числа 
  } 
console.log(pow(2,-2)) // виводмо значення, з вакзаним x та square 
