//homework
// 'number' + 3 + 3
//console.log('number' + 3 + 3)
//1. строка 'number' + число 3 = строка 'number3' (конкатенація)
//2. строка 'number3' + число 3 = строка 'number33' (конкатенацію)
// Answer: number33

// null + 3
// console.log(null + 3)
// 1. null = число 0
// число 0 + число 3 = (арифметична дія) число 3\
// Answee: 3

// 5 && "qwerty"
// console.log(5 && "qwerty")
// 1. 5 — це truth значення (не нуль, не пустий рядок, не null і т.д.)
// 2. Оператор && повертає другий операнд, якщо перший truthy
// Answer: "qwerty"

// +'40' + +'2' + "hillel"
// console.log(+'40' + +'2'+ "hillel")
// 1. +перед стрінгою вказує на те, що стрнга міняє типа на число
// 2. + між значеннями вказує на дію додавання
// 3. Виходить, що '40' i '2' перетворюються на числа і сумуються як числа 
// 4. Потім число 42 сумується з стрінгом "hillel"
// Answer: 42hillel

// '10' - 5 === 6
// console.log('10' - 5 === 6)
// 1.'10' — рядок, 5 — число
// 2. Оператор "-" примусово перетворює рядок '10' на число 10
// 3. 10 - 5 = 5
// 4. Оператор === сторгої рівності порівнює і тип даних і значення. Тип даних однаковий, але значення відризняються (5 не дорівнює 6)
// 5. Answer: fasle

// true + false
// console.log(true + false)
// 1. true = 1, false = 0
// Арифметична дія 1+0 
// Answer: 1

// '4px' - 3
// console.log('4px' - 3)
// 1.'4px' — рядок, 3 — число
// 2. Оператор "-" примусово перетворює рядок '4px' на число
// 3. Оскільки '4px' не є число, то 
// Answer: NaN

// '6' + 3 ** 0;
// console.log('6' + 3 ** 0)
//1. ** - оператор зведення до степеня, отже зводио 3 до степеня 0 = 1
//2. стрінга '6' + число 1 = 61 - тип даних строка (можна перевірити через typeof)  (конкатенація)

// 12 / '6'
// console.log(12 / '6')
// 1. "/" перетворює рядок '6' на число 
// 2. арифметична операція ділення 12/6
// Answer: 2

// '10' + (5 === 6);
// console.log('10' + (5 === 6))
// 1. Спочатку порівнюєм значення 5===6 - буде false
// 2. Потім відбуваєтсья контактинація, оскільки "10"- це рядок 
// Answer:10false

// null == ''
// console.log(null == '')
// 1. null == undefined -> true і тільки йому, тому
// Answer: false

// 3 ** (9 / 3);
// console.log(3 ** (9 / 3))
// 1. Спочатку робимо дію в дужках число 9/число 3 = число 3
// 2. Потім зводим отримане число до степеня 3, тому що "**" - оператор зведення до степеня 
// Answer: 27

// !!'false' == !!'true'
// console.log(!!'false' == !!'true')
// 1. !!'false' → true, бо рядок непустий
// 2. !!'true' → true, бо рядок непустий
// 3. true == true
// Answer: true

// 0 || '0' && 1
// console.log(0 || '0' && 1)
// 1. && - має вищий пріорітет, отже ця операція виконується першою. Якщо перший операнд в операції true, то повертається другий операнд. Перший операнд true, оскільки це не пусти рядок "", null, undefined, 0, 0n
// 2. Потім виконуєм операцію || (or). повертає true, якщо хоча б один з операндів є true, інакше повертає false
// 3. 0||1- false, оскільки 0 вважається як false, отже
// Answer: 1 
// (+null == false) < 1;
// console.log((+null == false) < 1)
// 1. Спочатку виконуєс дію в дужках. +null (примусове перетсворення в число) приводится до числа = 0, false приводится до число = 0, отже 0 == 0 -> true
// 2. True призводиться до числа 1
// 3. Порівнємо 1 < 1 
// Answer: false

// false && true || true
// console.log(false && true || true)
// 1. Виконуємо першу дію && (and), бо вона має більший пріорітет false && true -> false - оскільки дія не повертаяє true йдемо далі
// 2. Виконуємо 2-гу дію || (or) false || true - повертає перший true
// Answer: true
 
// false && (false || true);
// console.log(false && (false || true))
// 1. Спочатку виконуєм дію в дужках false || true = true, оскільки повераєм перше значення true
// 2. Друга дія false && true, оскільки перший операнд у нас false, то оператор && повертає значення false
// Answer: false

// (+null == false) < 1 ** 5;
// console.log((+null == false) < 1 ** 5)
// 1. Призводим до степеня 1**5 = 1
// 2. Дія в дужках. +null призводится до числа = 0, false призводится до числа = 0, отже дія в дужках true
// 3. Treu призводится до числа = 1 і виконується дія порівняння 1 < 1
// Answer: false 