function checkProbabilityTheory(count) {
    let num0 = 0 // назначаєм перемінну для каунтера нуля (для закріплення навичок)
    let num1 = 0; // назначаєм перемінну для каунтера непарних чисел
    let num2 = 0; // назвачаємо перемінну для каунтра парних чисел (окрім нуля)
    let min = 0;
    let max = 100; // задаєм максимельне та мінімальне значення 
  
    for (let a = 0; a < count; a++) { // створюємо цикл, для генерації рандомних чисел кільксть залежить від значення count 
      let random = Math.floor(Math.random() * (max - min + 1) + min); // генеруємо рандомні числа 
      if (random === 0) num0 ++ // для досвіду, вирішив винести окремо число 0
      else
      if (random % 2 === 0) num2++; // умова при якій, залишок згенерованого рандомного числа після ділення на 2 строго дорівнює нулю, до значення каунтера парного числа збільшується на 1 
      else num1++; // умова при якій, залишок згенерованого рандомного числа після ділення на 2 строго не дорівнює нулю, до значення каунтера непарного числа збільшується на 1 
    }
    let withoutZero = num1+num2 // виокремлюєм нулі
    let num2Percent = (num2/withoutZero)*100 // підраховуєм процентне значення парних чисел 
    let num1Percent = (num1/withoutZero)*100 // підраховуєм процентне значення непарних чисел
    return {
        Кількість: count,
        Нуль: num0,
        Парні: num2,
        Непарні: num1,
        Відсоток_парних: Math.round (num2Percent) + '%',
        Відсоток_непарних: Math.round (num1Percent) + '%'
    }                                                           // виводимо значення об'єктом 
  }
  
  console.log(checkProbabilityTheory(1000)); // запускаєм функцію з проставленим значенням count 